src_ext/InformationRegisters/УЗ_НастройкиОплатыQR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_НастройкиОплатыQR</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ПровайдерыОплатыQR</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМинут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_КлючиОплатыQR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_КлючиОплатыQR</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_ПровайдерыОплатыQR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УЗ_ПровайдерыОплатыQR</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Точка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТБанк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/CommonModules/УЗ_ПровайдерыОплатQR/Ext/Module.bsl
//Банки для оплаты по QR через СБП (динамический QR на сумму): Точка (Open API, раздел СБП) и Т-Банк
//(интернет-эквайринг,
//методы Init, GetQr, GetState, Cancel) — по их публичной документации (сентябрь 2026). Общий интерфейс: СоздатьQR,
//СтатусОплаты, ОтменитьQR. Запросы уходят только через единственную точку HTTP УЗ_ПровайдерыСообщений.ЗапросHTTP:
//в песочнице сеанса (тесты на копиях баз) — только на эту машину (127.0.0.1 — заглушка банков в тестах), безопасный
//режим — понятным текстом, ключ не попадает ни в журнал регистрации, ни в текст ошибки.
//Ключ доступа (токен Точки, пароль терминала Т-Банка) читается только здесь, в привилегированном режиме.

#Область ПрограммныйИнтерфейс

//Адрес сервиса банка по умолчанию (боевой). В настройках его можно заменить — например, на тестовый контур банка
//или на заглушку в тестах.
Функция АдресПоУмолчанию(Провайдер) Экспорт

	Если Провайдер = Перечисления.УЗ_ПровайдерыОплатыQR.Точка Тогда
		Возврат "https://enter.tochka.com/uapi";
	ИначеЕсли Провайдер = Перечисления.УЗ_ПровайдерыОплатыQR.ТБанк Тогда
		Возврат "https://securepay.tinkoff.ru";
	КонецЕсли;
	Возврат "";

КонецФункции

//Нужен ли банку расчётный счёт в настройках (Точка: QR регистрируется на счёт «номер/БИК»).
Функция НуженСчет(Провайдер) Экспорт
	Возврат Провайдер = Перечисления.УЗ_ПровайдерыОплатыQR.Точка;
КонецФункции

//Умеет ли банк отменить выставленный QR (Т-Банк — Cancel; у Точки динамический QR живёт до своего срока).
Функция УмеетОтменять(Провайдер) Экспорт
	Возврат Провайдер = Перечисления.УЗ_ПровайдерыОплатыQR.ТБанк;
КонецФункции

//Настройки банка организации с ключом — только для запросов; Неопределено — не настроено (Причина — почему).
//Структура: Организация, Провайдер, Адрес, Логин, НомерСчета, Касса, СрокМинут, Ключ и события журнала для
//УЗ_ПровайдерыСообщений.ЗапросHTTP.
Функция ПараметрыБанка(Организация, Причина) Экспорт

	Параметры = Новый Структура("Организация, Провайдер, Адрес, Логин, НомерСчета, Касса, СрокМинут, Ключ",
		Организация);
	Параметры.Вставить("СобытиеПесочницы", СобытиеПесочницы());
	Параметры.Вставить("СобытиеОтправки", СобытиеЗапроса());
	Параметры.Вставить("СобытиеОшибки", СобытиеОшибки());
	Параметры.Вставить("ТекстБезопасногоРежима", НСтр("ru = 'Запросы к банку в безопасном режиме запрещены.'"));
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Запись = РегистрыСведений.УЗ_НастройкиОплатыQR.СоздатьМенеджерЗаписи();
		Запись.Организация = Организация;
		Запись.Прочитать();
		Ключ = РегистрыСведений.УЗ_КлючиОплатыQR.СоздатьМенеджерЗаписи();
		Ключ.Организация = Организация;
		Ключ.Прочитать();
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		//безопасный режим: привилегированный режим не действует, а ролям ключи недоступны
		УстановитьПривилегированныйРежим(Ложь);
		Причина = НСтр("ru = 'Настройки банка недоступны:'") + " " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки;
	Если Не Запись.Выбран() Или Не Запись.Включен Тогда
		Причина = СтрШаблон(НСтр(
			"ru = 'Оплата по QR не включена у организации «%1» (Касса → Оплата по QR (СБП): настройки банка).'"),
			Организация);
		Возврат Неопределено;
	ИначеЕсли Не ЗначениеЗаполнено(Запись.Провайдер) Тогда
		Причина = СтрШаблон(НСтр("ru = 'В настройках оплаты по QR организации «%1» не выбран банк.'"), Организация);
		Возврат Неопределено;
	ИначеЕсли Не Ключ.Выбран() Или ПустаяСтрока(Ключ.Ключ) Тогда
		Причина = СтрШаблон(НСтр("ru = 'В настройках оплаты по QR организации «%1» не задан ключ доступа банка.'"),
			Организация);
		Возврат Неопределено;
	ИначеЕсли ПустаяСтрока(Запись.Логин) Тогда
		Причина = СтрШаблон(НСтр(
			"ru = 'В настройках оплаты по QR организации «%1» не указан идентификатор магазина (%2).'"),
			Организация, ?(Запись.Провайдер = Перечисления.УЗ_ПровайдерыОплатыQR.Точка, "merchantId", "TerminalKey"));
		Возврат Неопределено;
	ИначеЕсли НуженСчет(Запись.Провайдер) И ПустаяСтрока(Запись.НомерСчета) Тогда
		Причина = СтрШаблон(НСтр("ru = 'В настройках оплаты по QR организации «%1» не указан расчётный счёт и БИК
			|(в виде 40702810000000000000/044525104).'"), Организация);
		Возврат Неопределено;
	КонецЕсли;
	Параметры.Провайдер = Запись.Провайдер;
	Параметры.Адрес = ?(ПустаяСтрока(Запись.АдресСервиса), АдресПоУмолчанию(Запись.Провайдер), СокрЛП(
		Запись.АдресСервиса));
	Параметры.Логин = СокрЛП(Запись.Логин);
	Параметры.НомерСчета = СокрЛП(Запись.НомерСчета);
	Параметры.Касса = Запись.Касса;
	Параметры.СрокМинут = ?(Запись.СрокМинут > 0, Запись.СрокМинут, СрокПоУмолчанию());
	Параметры.Ключ = СокрЛП(Ключ.Ключ);
	Возврат Параметры;

КонецФункции

//Срок действия QR по умолчанию, минут (у стойки — на время оплаты; ссылка в мессенджере — до вечера не нужна).
Функция СрокПоУмолчанию() Экспорт
	Возврат 60;
КонецФункции

//Выставить динамический QR на сумму.
//  Данные — Структура: Сумма (руб.), Назначение (до 140 знаков), НомерЗаказа (строка до 36 знаков, уникальная),
//  СрокДействия (Дата), СрокМинут.
//Структура: Успех, Песочница (запрос задержан песочницей), СервисНедоступен, ТекстОшибки, Идентификатор (qrcId /
//PaymentId), Ссылка (https://qr.nspk.ru/… — ссылка на оплату), Картинка (ДвоичныеДанные PNG или SVG; Неопределено —
//банк картинку не дал).
Функция СоздатьQR(Параметры, Данные) Экспорт

	Итог = Новый Структура("Успех, Песочница, СервисНедоступен, ТекстОшибки, Идентификатор, Ссылка, Картинка", Ложь,
		Ложь,
		Ложь, "", "", "", Неопределено);
	Если Параметры.Провайдер = Перечисления.УЗ_ПровайдерыОплатыQR.Точка Тогда
		СоздатьQRТочка(Параметры, Данные, Итог);
	ИначеЕсли Параметры.Провайдер = Перечисления.УЗ_ПровайдерыОплатыQR.ТБанк Тогда
		СоздатьQRТБанк(Параметры, Данные, Итог);
	Иначе
		Итог.ТекстОшибки = НСтр("ru = 'Не выбран банк для оплаты по QR.'");
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Статус оплаты выставленного QR.
//Структура: Успех, Песочница, СервисНедоступен, ТекстОшибки, Статус (строка: «Ожидает», «Оплачен», «Отклонен»,
//«Истек», «Отменен»), ИдОперации (номер операции СБП / платежа в банке), СтатусБанка (как ответил банк).
Функция СтатусОплаты(Параметры, Идентификатор) Экспорт

	Итог = Новый Структура("Успех, Песочница, СервисНедоступен, ТекстОшибки, Статус, ИдОперации, СтатусБанка, "
		+ "Сумма", Ложь,
		Ложь, Ложь, "", "", "", "", Неопределено);
	Если Параметры.Провайдер = Перечисления.УЗ_ПровайдерыОплатыQR.Точка Тогда
		СтатусТочка(Параметры, Идентификатор, Итог);
	ИначеЕсли Параметры.Провайдер = Перечисления.УЗ_ПровайдерыОплатыQR.ТБанк Тогда
		СтатусТБанк(Параметры, Идентификатор, Итог);
	Иначе
		Итог.ТекстОшибки = НСтр("ru = 'Не выбран банк для оплаты по QR.'");
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Отменить выставленный QR в банке (Т-Банк — Cancel). Банк без отмены — Успех: QR сам истечёт в свой срок.
//Структура: Успех, Песочница, СервисНедоступен, ТекстОшибки.
Функция ОтменитьQR(Параметры, Идентификатор) Экспорт

	Итог = Новый Структура("Успех, Песочница, СервисНедоступен, ТекстОшибки", Ложь, Ложь, Ложь, "");
	Если Не УмеетОтменять(Параметры.Провайдер) Тогда
		Итог.Успех = Истина;
		Возврат Итог;
	КонецЕсли;
	Тело = ТелоТБанк(Параметры, Новый Структура("PaymentId", Идентификатор));
	Ответ = Запрос(Параметры, "POST", "/v2/Cancel", Тело, НСтр("ru = 'Т-Банк: отмена QR'"));
	Если Ответ = Неопределено Тогда
		Возврат Итог;
	КонецЕсли;
	Если РазобратьСвязь(Ответ, Итог) Тогда
		Возврат Итог;
	КонецЕсли;
	Данные = УЗ_ПровайдерыСообщений.ПрочитатьОтвет(Ответ);
	Если Данные <> Неопределено И Данные.Получить("Success") = Истина Тогда
		Итог.Успех = Истина;
	Иначе
		Итог.ТекстОшибки = "Т-Банк: " + ТекстОшибкиТБанк(Ответ, Данные);
		Итог.СервисНедоступен = ЭтоОтказСервиса(Ответ);
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Подпись запроса Т-Банка (Token): значения корневых полей запроса (без вложенных объектов) и Password, упорядоченные
//по имени поля, склеенные подряд, — SHA-256 в шестнадцатеричном виде строчными буквами.
Функция ТокенТБанк(Поля, Пароль) Экспорт

	Имена = Новый СписокЗначений;
	Для Каждого Поле Из Поля Цикл
		Если Поле.Ключ = "Token" Или ТипЗнч(Поле.Значение) = Тип("Структура") Или ТипЗнч(Поле.Значение) = Тип(
			"Соответствие")
			Или ТипЗнч(Поле.Значение) = Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		Имена.Добавить(Поле.Ключ);
	КонецЦикла;
	Имена.Добавить("Password");
	Имена.СортироватьПоЗначению();
	Части = Новый Массив;
	Для Каждого Имя Из Имена Цикл
		Значение = ?(Имя.Значение = "Password", Пароль, Поля[Имя.Значение]);
		Части.Добавить(ЗначениеДляТокена(Значение));
	КонецЦикла;
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(ПолучитьДвоичныеДанныеИзСтроки(СтрСоединить(Части, ""), КодировкаТекста.UTF8,
		Ложь));
	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма));

КонецФункции

//Событие журнала регистрации: запрос к банку задержан песочницей (наружу не ушёл).
Функция СобытиеПесочницы() Экспорт
	Возврат НСтр("ru = 'Учёт занятий.Оплата по QR.Песочница'");
КонецФункции

//Событие журнала регистрации: настоящий запрос к банку (пишется до подключения).
Функция СобытиеЗапроса() Экспорт
	Возврат НСтр("ru = 'Учёт занятий.Оплата по QR.Запрос'");
КонецФункции

//Событие журнала регистрации: ошибки оплаты по QR (банк, приход по оплате).
Функция СобытиеОшибки() Экспорт
	Возврат НСтр("ru = 'Учёт занятий.Оплата по QR'");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Точка

//Точка: POST /sbp/v1.0/qr-code/merchant/{merchantId}/{accountId} — регистрация динамического QR (qrcType 02) на сумму
//в копейках, с картинкой PNG. Ответ Data: payload (ссылка https://qr.nspk.ru/…), qrcId, image.content (Base64).
Процедура СоздатьQRТочка(Параметры, Данные, Итог)

	Картинка = Новый Структура("width, height, mediaType", 300, 300, "image/png");
	Поля = Новый Структура("amount, currency, paymentPurpose, qrcType, imageParams, sourceName, ttl", Копейки(
		Данные.Сумма),
		"RUB", Лев(Данные.Назначение, 140), "02", Картинка, "Uchet zanyatiy", Данные.СрокМинут);
	Путь = СтрШаблон("/sbp/v1.0/qr-code/merchant/%1/%2", Параметры.Логин, Параметры.НомерСчета);
	Ответ = Запрос(Параметры, "POST", Путь, Новый Структура("Data", Поля), НСтр("ru = 'Точка: выставить QR'"));
	Если РазобратьСвязь(Ответ, Итог) Тогда
		Возврат;
	КонецЕсли;
	ОтветJSON = УЗ_ПровайдерыСообщений.ПрочитатьОтвет(Ответ);
	ДанныеОтвета = ?(ОтветJSON = Неопределено, Неопределено, ОтветJSON.Получить("Data"));
	Если Ответ.КодСостояния <> 200 Или ТипЗнч(ДанныеОтвета) <> Тип("Соответствие")
		Или ПустаяСтрока(СтрокаJSON(ДанныеОтвета.Получить("qrcId"))) Тогда
		Итог.ТекстОшибки = "Точка: " + ТекстОшибкиТочка(Ответ, ОтветJSON);
		Итог.СервисНедоступен = ЭтоОтказСервиса(Ответ);
		Возврат;
	КонецЕсли;
	Итог.Идентификатор = СтрокаJSON(ДанныеОтвета.Получить("qrcId"));
	Итог.Ссылка = СтрокаJSON(ДанныеОтвета.Получить("payload"));
	Изображение = ДанныеОтвета.Получить("image");
	Если ТипЗнч(Изображение) = Тип("Соответствие") И Не ПустаяСтрока(СтрокаJSON(Изображение.Получить("content"))) Тогда
		Итог.Картинка = Base64Значение(СтрокаJSON(Изображение.Получить("content")));
	КонецЕсли;
	Итог.Успех = Истина;

КонецПроцедуры

//Точка: GET /sbp/v1.0/qr-codes/{qrcId}/payment-status → Data.paymentList[]: status NotStarted, Received, InProgress —
//ждём; Accepted — оплачен; Rejected — отклонён; trxId — номер операции СБП.
Процедура СтатусТочка(Параметры, Идентификатор, Итог)

	Путь = СтрШаблон("/sbp/v1.0/qr-codes/%1/payment-status", КодироватьСтроку(Идентификатор,
		СпособКодированияСтроки.КодировкаURL));
	Ответ = Запрос(Параметры, "GET", Путь, Неопределено, НСтр("ru = 'Точка: статус оплаты QR'"));
	Если РазобратьСвязь(Ответ, Итог) Тогда
		Возврат;
	КонецЕсли;
	ОтветJSON = УЗ_ПровайдерыСообщений.ПрочитатьОтвет(Ответ);
	ДанныеОтвета = ?(ОтветJSON = Неопределено, Неопределено, ОтветJSON.Получить("Data"));
	Список = ?(ТипЗнч(ДанныеОтвета) = Тип("Соответствие"), ДанныеОтвета.Получить("paymentList"), Неопределено);
	Если Ответ.КодСостояния <> 200 Или ТипЗнч(Список) <> Тип("Массив") Тогда
		Итог.ТекстОшибки = "Точка: " + ТекстОшибкиТочка(Ответ, ОтветJSON);
		Итог.СервисНедоступен = ЭтоОтказСервиса(Ответ);
		Возврат;
	КонецЕсли;
	Итог.Успех = Истина;
	Итог.Статус = "Ожидает";
	Для Каждого Платеж Из Список Цикл
		Если ТипЗнч(Платеж) <> Тип("Соответствие") Или СтрокаJSON(Платеж.Получить("qrcId")) <> Идентификатор Тогда
			Продолжить;
		КонецЕсли;
		Итог.СтатусБанка = СтрокаJSON(Платеж.Получить("status"));
		Итог.ИдОперации = СтрокаJSON(Платеж.Получить("trxId"));
		Если ТипЗнч(Платеж.Получить("amount")) = Тип("Число") Тогда
			Итог.Сумма = Платеж.Получить("amount") / 100;
		КонецЕсли;
		Если Итог.СтатусБанка = "Accepted" Тогда
			Итог.Статус = "Оплачен";
		ИначеЕсли Итог.СтатусБанка = "Rejected" Тогда
			Итог.Статус = "Отклонен";
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ТекстОшибкиТочка(Ответ, Данные)

	Если Данные <> Неопределено Тогда
		Ошибки = Данные.Получить("Errors");
		Если ТипЗнч(Ошибки) = Тип("Массив") И Ошибки.Количество() > 0 И ТипЗнч(Ошибки[0]) = Тип("Соответствие") Тогда
			Возврат СтрШаблон(НСтр("ru = '%1 (код ответа %2)'"), СтрокаJSON(Ошибки[0].Получить("message")),
				Формат(Ответ.КодСостояния, "ЧГ=0; ЧН=0"));
		ИначеЕсли Не ПустаяСтрока(СтрокаJSON(Данные.Получить("message"))) Тогда
			Возврат СтрШаблон(НСтр("ru = '%1 (код ответа %2)'"), СтрокаJSON(Данные.Получить("message")),
				Формат(Ответ.КодСостояния, "ЧГ=0; ЧН=0"));
		КонецЕсли;
	КонецЕсли;
	Возврат ТекстКода(Ответ);

КонецФункции

#КонецОбласти

#Область ТБанк

//Т-Банк: POST /v2/Init (платёж на сумму в копейках, OrderId, срок RedirectDueDate) → PaymentId; затем /v2/GetQr
//DataType PAYLOAD (ссылка СБП) и IMAGE (картинка SVG). Каждый запрос подписан Token (ТокенТБанк).
Процедура СоздатьQRТБанк(Параметры, Данные, Итог)

	Поля = Новый Структура("Amount, OrderId, Description, RedirectDueDate", Копейки(Данные.Сумма), Данные.НомерЗаказа,
		Лев(Данные.Назначение, 140), ДатаISO(Данные.СрокДействия));
	Ответ = Запрос(Параметры, "POST", "/v2/Init", ТелоТБанк(Параметры, Поля), НСтр("ru = 'Т-Банк: платёж для QR'"));
	Если РазобратьСвязь(Ответ, Итог) Тогда
		Возврат;
	КонецЕсли;
	ДанныеJSON = УЗ_ПровайдерыСообщений.ПрочитатьОтвет(Ответ);
	Если ДанныеJSON = Неопределено Или ДанныеJSON.Получить("Success") <> Истина
		Или ПустаяСтрока(СтрокаJSON(ДанныеJSON.Получить("PaymentId"))) Тогда
		Итог.ТекстОшибки = "Т-Банк: " + ТекстОшибкиТБанк(Ответ, ДанныеJSON);
		Итог.СервисНедоступен = ЭтоОтказСервиса(Ответ);
		Возврат;
	КонецЕсли;
	Идентификатор = СтрокаJSON(ДанныеJSON.Получить("PaymentId"));
	Ссылка = ДанныеQRТБанк(Параметры, Идентификатор, "PAYLOAD", Итог);
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Картинка = ДанныеQRТБанк(Параметры, Идентификатор, "IMAGE", Итог);
	Если Картинка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Итог.Идентификатор = Идентификатор;
	Итог.Ссылка = Ссылка;
	Если Не ПустаяСтрока(Картинка) Тогда
		Итог.Картинка = ПолучитьДвоичныеДанныеИзСтроки(Картинка, КодировкаТекста.UTF8, Ложь);
	КонецЕсли;
	Итог.Успех = Истина;

КонецПроцедуры

//GetQr: Data — ссылка (PAYLOAD) или SVG (IMAGE); Неопределено — ошибка (текст — в Итог).
Функция ДанныеQRТБанк(Параметры, Идентификатор, ВидДанных, Итог)

	Поля = Новый Структура("PaymentId, DataType", Идентификатор, ВидДанных);
	Ответ = Запрос(Параметры, "POST", "/v2/GetQr", ТелоТБанк(Параметры, Поля), НСтр("ru = 'Т-Банк: QR СБП'"));
	Если РазобратьСвязь(Ответ, Итог) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Данные = УЗ_ПровайдерыСообщений.ПрочитатьОтвет(Ответ);
	Если Данные = Неопределено Или Данные.Получить("Success") <> Истина Или ПустаяСтрока(СтрокаJSON(Данные.Получить(
		"Data"))) Тогда
		Итог.ТекстОшибки = "Т-Банк: " + ТекстОшибкиТБанк(Ответ, Данные);
		Итог.СервисНедоступен = ЭтоОтказСервиса(Ответ);
		Возврат Неопределено;
	КонецЕсли;
	Возврат СтрокаJSON(Данные.Получить("Data"));

КонецФункции

//GetState: Status CONFIRMED — оплачен; REJECTED, AUTH_FAIL — отклонён; DEADLINE_EXPIRED — истёк; CANCELED, REVERSED —
//отменён; остальные (NEW, FORM_SHOWED, AUTHORIZING, CONFIRMING…) — ждём.
Процедура СтатусТБанк(Параметры, Идентификатор, Итог)

	Ответ = Запрос(Параметры, "POST", "/v2/GetState", ТелоТБанк(Параметры, Новый Структура("PaymentId", Идентификатор)),
		НСтр("ru = 'Т-Банк: статус оплаты QR'"));
	Если РазобратьСвязь(Ответ, Итог) Тогда
		Возврат;
	КонецЕсли;
	Данные = УЗ_ПровайдерыСообщений.ПрочитатьОтвет(Ответ);
	Если Данные = Неопределено Или Данные.Получить("Success") <> Истина Тогда
		Итог.ТекстОшибки = "Т-Банк: " + ТекстОшибкиТБанк(Ответ, Данные);
		Итог.СервисНедоступен = ЭтоОтказСервиса(Ответ);
		Возврат;
	КонецЕсли;
	Итог.Успех = Истина;
	Итог.СтатусБанка = СтрокаJSON(Данные.Получить("Status"));
	Итог.ИдОперации = СтрокаJSON(Данные.Получить("PaymentId"));
	Если ТипЗнч(Данные.Получить("Amount")) = Тип("Число") Тогда
		Итог.Сумма = Данные.Получить("Amount") / 100;
	КонецЕсли;
	Статусы = Новый Соответствие;
	Статусы.Вставить("CONFIRMED", "Оплачен");
	Статусы.Вставить("REJECTED", "Отклонен");
	Статусы.Вставить("AUTH_FAIL", "Отклонен");
	Статусы.Вставить("DEADLINE_EXPIRED", "Истек");
	Статусы.Вставить("CANCELED", "Отменен");
	Статусы.Вставить("REVERSED", "Отменен");
	Статус = Статусы.Получить(Итог.СтатусБанка);
	Итог.Статус = ?(Статус = Неопределено, "Ожидает", Статус);

КонецПроцедуры

//Тело запроса Т-Банка: поля, TerminalKey и подпись Token.
Функция ТелоТБанк(Параметры, Поля)

	Тело = Новый Структура("TerminalKey", Параметры.Логин);
	Для Каждого Поле Из Поля Цикл
		Тело.Вставить(Поле.Ключ, Поле.Значение);
	КонецЦикла;
	Тело.Вставить("Token", ТокенТБанк(Тело, Параметры.Ключ));
	Возврат Тело;

КонецФункции

Функция ЗначениеДляТокена(Значение)

	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Формат(Значение, "ЧГ=0; ЧН=0; ЧРД=.");
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		Возврат ?(Значение, "true", "false");
	КонецЕсли;
	Возврат Строка(Значение);

КонецФункции

Функция ТекстОшибкиТБанк(Ответ, Данные)

	Если Данные <> Неопределено И Не ПустаяСтрока(СтрокаJSON(Данные.Получить("Message"))) Тогда
		Подробно = СтрокаJSON(Данные.Получить("Details"));
		Возврат СтрШаблон(НСтр("ru = '%1%2 (код ошибки %3)'"), СтрокаJSON(Данные.Получить("Message")),
			?(ПустаяСтрока(Подробно), "", ": " + Подробно), СтрокаJSON(Данные.Получить("ErrorCode")));
	КонецЕсли;
	Возврат ТекстКода(Ответ);

КонецФункции

#КонецОбласти

#Область Общее

//Запрос через единственную точку HTTP (песочница, таймаут, скрытие ключа). Тело — Структура (в JSON) или Неопределено.
Функция Запрос(Параметры, Метод, Путь, Тело, Описание)

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Заголовки.Вставить("Accept", "application/json");
	Если Параметры.Провайдер = Перечисления.УЗ_ПровайдерыОплатыQR.Точка Тогда
		Заголовки.Вставить("Authorization", "Bearer " + Параметры.Ключ);
	КонецЕсли;
	ТекстТела = "";
	Если Тело <> Неопределено Тогда
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, Тело);
		ТекстТела = Запись.Закрыть();
	КонецЕсли;
	Возврат УЗ_ПровайдерыСообщений.ЗапросHTTP(Параметры, Метод, Путь, Заголовки, ТекстТела, Описание);

КонецФункции

//Песочница (запрос не ушёл) или нет связи — Истина: разбор ответа не нужен.
Функция РазобратьСвязь(Ответ, Итог)

	Если Ответ.Песочница Тогда
		Итог.Песочница = Истина;
		Итог.ТекстОшибки = НСтр(
			"ru = 'Запрос к банку не отправлен: песочница (копия базы для тестов) — наружу запросы не уходят.'");
		Возврат Истина;
	КонецЕсли;
	Если Не ПустаяСтрока(Ответ.Ошибка) Тогда
		Итог.ТекстОшибки = Ответ.Ошибка;
		Итог.СервисНедоступен = Истина;
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;

КонецФункции

//Отказ сервиса целиком (неверный ключ, банк недоступен): 401, 403, 404, 429, 5xx — остальным в этом цикле не ходим.
Функция ЭтоОтказСервиса(Ответ)
	Возврат Ответ.КодСостояния = 401 Или Ответ.КодСостояния = 403 Или Ответ.КодСостояния = 404
		Или Ответ.КодСостояния = 429 Или Ответ.КодСостояния >= 500;
КонецФункции

Функция ТекстКода(Ответ)
	Возврат СтрШаблон(НСтр("ru = 'банк ответил кодом %1'"), Формат(Ответ.КодСостояния, "ЧГ=0; ЧН=0"))
		+ ?(ПустаяСтрока(Ответ.Тело), "", ": " + Лев(Ответ.Тело, 200));
КонецФункции

//Значение из JSON строкой: число — без разделителей (PaymentId Т-Банка — число), Неопределено — "".
Функция СтрокаJSON(Значение)

	Если Значение = Неопределено Тогда
		Возврат "";
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Формат(Значение, "ЧГ=0; ЧН=0");
	КонецЕсли;
	Возврат Строка(Значение);

КонецФункции

Функция Копейки(Сумма)
	Возврат Окр(Сумма * 100, 0);
КонецФункции

//Дата в ISO 8601 со смещением пояса базы: 2026-09-30T13:00:00+03:00.
Функция ДатаISO(Дата)

	Смещение = Окр((Дата - УниверсальноеВремя(Дата)) / 60, 0);
	Знак = ?(Смещение < 0, "-", "+");
	Смещение = ?(Смещение < 0, -Смещение, Смещение);
	Возврат Формат(Дата, "ДФ=yyyy-MM-dd") + "T" + Формат(Дата, "ДФ=HH:mm:ss") + Знак + Формат(Цел(Смещение / 60),
		"ЧЦ=2; ЧВН=; ЧГ=0") + ":"
		+ Формат(Смещение % 60, "ЧЦ=2; ЧВН=; ЧГ=0");

КонецФункции

#КонецОбласти

#КонецОбласти
